export type Star = "木星"|"火星"|"土星"|"金星"|"水星"|"紫炁"|"月孛"|"羅劫"|"計都";
export type Palace = "子"|"丑"|"寅"|"卯"|"辰"|"巳"|"午"|"未"|"申"|"酉"|"戌"|"亥";

export const KOKU_MAP: Record<Star, Partial<Record<Palace, ("受尅"|"失令"|"泄気")[]>>> = {
  木星: {辰:["受尅"],酉:["受尅"],申:["失令"],戌:["失令"],卯:["泄気"]},
  火星: {申:["受尅"],巳:["受尅"],亥:["失令"],子:["失令","泄気"],丑:["失令","泄気"]},
  土星: {寅:["受尅","失令"],亥:["受尅"],卯:["失令"],辰:["失令","泄気"],酉:["泄気"]},
  金星: {卯:["受尅"],戌:["受尅"],巳:["失令","泄気"],午:["失令"],未:["失令"],申:["泄気"]},
  水星: {子:["受尅"],丑:["受尅"],寅:["泄気"],亥:["泄気"]},
  紫炁: {辰:["受尅"],酉:["受尅"],申:["失令"],戌:["失令"],卯:["泄気"]},
  月孛: {子:["受尅"],丑:["受尅"],寅:["泄気"],亥:["泄気"]},
  羅劫: {申:["受尅"],巳:["受尅"],亥:["失令"],子:["失令","泄気"],丑:["失令","泄気"]},
  計都: {寅:["受尅","失令"],亥:["受尅"],卯:["失令"],辰:["失令","泄気"],酉:["泄気"]},
};