export type Star = "日"|"月"|"水"|"金"|"火"|"木"|"土"|"羅劫"|"計都"|"月孛"|"紫炁";
export type Palace = "子"|"丑"|"寅"|"卯"|"辰"|"巳"|"午"|"未"|"申"|"酉"|"戌"|"亥";

export const NYUUEN_MAP: Record<Star, Palace[]> = {
  日: ["寅","辰"],
  月: ["卯"],
  水: ["辰"],
  金: ["辰"],
  土: ["子","丑"],
  火: ["丑","卯"],
  木: ["寅"],
  計都: ["子","卯"],
  羅劫: [],
  月孛: [],
  紫炁: [],
};

export const SYOUDEN_MAP: Record<Star, Palace[]> = {
  日: ["午"],
  月: ["戌"],
  水: ["巳"],
  金: ["酉"],
  土: ["子","丑"],
  火: ["寅"],
  木: ["亥"],
  計都: ["戌"],
  羅劫: [],
  月孛: [],
  紫炁: [],
};

export const KIRAKU_MAP: Record<Star, Record<Palace,"喜"|"楽"|"">> = {
  日:   {子:"",丑:"",寅:"喜",卯:"",辰:"楽",巳:"",午:"",未:"",申:"",酉:"",戌:"",亥:""},
  月:   {子:"",丑:"",寅:"",卯:"喜",辰:"",巳:"",午:"",未:"",申:"",酉:"",戌:"",亥:""},
  水:   {子:"",丑:"",寅:"",卯:"",辰:"喜",巳:"",午:"",未:"",申:"",酉:"",戌:"",亥:""},
  金:   {子:"",丑:"",寅:"",卯:"",辰:"楽",巳:"",午:"",未:"",申:"",酉:"",戌:"",亥:""},
  土:   {子:"楽",丑:"楽",寅:"",卯:"",辰:"",巳:"",午:"",未:"",申:"",酉:"",戌:"",亥:""},
  火:   {子:"",丑:"喜",寅:"",卯:"楽",辰:"",巳:"",午:"",未:"",申:"",酉:"",戌:"",亥:""},
  木:   {子:"",丑:"",寅:"楽",卯:"",辰:"",巳:"",午:"",未:"",申:"",酉:"",戌:"",亥:""},
  計都: {子:"喜",丑:"",寅:"",卯:"楽",辰:"",巳:"",午:"",未:"",申:"",酉:"",戌:"",亥:""},
  羅劫: {子:"",丑:"",寅:"",卯:"",辰:"",巳:"",午:"",未:"",申:"",酉:"",戌:"",亥:""},
  月孛: {子:"",丑:"",寅:"",卯:"",辰:"",巳:"",午:"",未:"",申:"",酉:"",戌:"",亥:""},
  紫炁: {子:"",丑:"",寅:"",卯:"",辰:"",巳:"",午:"",未:"",申:"",酉:"",戌:"",亥:""},
};